# 1. Используем официальный образ Python как основу
FROM python:3.10-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями и устанавливаем их
# Этот шаг делается отдельно для эффективного кэширования слоев
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем все папки и файлы нашего проекта в рабочую директорию контейнера
# (скопирует папки 'models' и 'streamlit_app')
COPY . .

# 5. Сообщаем Docker, что контейнер будет слушать порт 8501
EXPOSE 8501

# 6. Команда, которая будет выполняться при запуске контейнера
# Мы запускаем app.py из подпапки streamlit_app
# --server.address=0.0.0.0 делает приложение доступным извне контейнера
ENTRYPOINT ["streamlit", "run", "streamlit_app/app.py", "--server.port=8501", "--server.address=0.0.0.0"]